### fundamentos de pandas

In [1]:
import pandas as pd

In [2]:
# crear un dataframe de ejemplo con nombres, apellidos y edades

data = pd.DataFrame(
    {
        'nombre': ['Juan', 'Ana', 'Pedro', 'Maria'],
        'apellido': ['Pérez', 'Gómez', 'López', 'Sánchez'],
        'edad': [28, 34, 45, 23]
    }
)

In [3]:
data

  nombre apellido  edad
0   Juan    Pérez    28
1    Ana    Gómez    34
2  Pedro    López    45
3  Maria  Sánchez    23

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   nombre    4 non-null      object
 1   apellido  4 non-null      object
 2   edad      4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [5]:
data['nombre']

0     Juan
1      Ana
2    Pedro
3    Maria
Name: nombre, dtype: object

In [6]:
data['edad']

0    28
1    34
2    45
3    23
Name: edad, dtype: int64

In [7]:
data[['nombre', 'edad']]

  nombre  edad
0   Juan    28
1    Ana    34
2  Pedro    45
3  Maria    23

In [8]:
data["edad"].max()

np.int64(45)

In [9]:
data['edad'].mean()

np.float64(32.5)

In [10]:
data['apellido'].str.upper()

0      PÉREZ
1      GÓMEZ
2      LÓPEZ
3    SÁNCHEZ
Name: apellido, dtype: object

In [11]:
data

  nombre apellido  edad
0   Juan    Pérez    28
1    Ana    Gómez    34
2  Pedro    López    45
3  Maria  Sánchez    23

In [12]:
# como hacer una copia del dataframe

data2 = data.copy()

In [13]:
data2

  nombre apellido  edad
0   Juan    Pérez    28
1    Ana    Gómez    34
2  Pedro    López    45
3  Maria  Sánchez    23

In [14]:
# como agregar una descripcion al dataframe

data2.describe()

            edad
count   4.000000
mean   32.500000
std     9.469248
min    23.000000
25%    26.750000
50%    31.000000
75%    36.750000
max    45.000000

#### cargar datos desde un archivo externo .csv

In [15]:
# leer el dataset titanic disponible en la carpeta del proyecto

df_titanic0 = pd.read_csv('titanic_dataset.csv')

In [16]:
df_titanic0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [17]:
df_titanic0.shape

(891, 12)

In [18]:
df_titanic0.shape[0]

891

In [19]:
df_titanic0.shape[1]

12

In [20]:
df_titanic0.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [21]:
#estructura para hacer una primera revision de los datos

df_titanic0.head(20)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C

In [22]:
df_titanic0.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [23]:
df_titanic0.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [24]:
df_titanic0.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### creacion de subconjuntos

In [25]:
#copia del dataframe titanic

df_titanic1 = df_titanic0.copy()

In [26]:
df_titanic1.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [ ]:
#extraer edad y sexo

df_titanic1[['Age', 'Sex']]

      Age     Sex
0    22.0    male
1    38.0  female
2    26.0  female
3    35.0  female
4    35.0    male
..    ...     ...
886  27.0    male
887  19.0  female
888   NaN  female
889  26.0    male
890  32.0    male

[891 rows x 2 columns]

In [ ]:
#definir un nuevo dataframe con edad y sexo

df_age_sex = df_titanic1[['Age','Sex']]

In [29]:
df_age_sex.describe()

              Age
count  714.000000
mean    29.699118
std     14.526497
min      0.420000
25%     20.125000
50%     28.000000
75%     38.000000
max     80.000000

In [30]:
df_age_sex.shape

(891, 2)

In [31]:
#como filtrar el dataframe por una condicion de edad, es decir, un conjunto de filas que cumplan con una condicion.
#ejemplo, pasajros con edad mayor a 30 años

df_titanic1[df_titanic1['Age'] > 30]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [33]:
# ahora un ejemplo con mas de una condicion, por ejemplo, pasajeros con edad mayor a 30 años y sexo femenino

df_titanic1[(df_titanic1['Age'] > 30) & (df_titanic1['Sex'] == 'female')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S
865,866,1,2,"Bystrom, Mrs. (Karolina)",female,42.0,0,0,236852,13.0000,NaN,S
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q

In [37]:
df_titanic1[df_titanic1['Sex'] == 'female']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [ ]:
#obtener solo la cantidad de un valor, por ejemplo, cuantas mujeres hay

df_titanic1[df_titanic1['Sex'] == 'female'].shape[0]

314

In [40]:
df_titanic1[(df_titanic1['Age'] > 30) & (df_titanic1['Sex'] == 'female')].shape[0]

103

In [41]:
df_female30 = df_titanic1[(df_titanic1['Age'] > 30) & (df_titanic1['Sex'] == 'female')]

In [42]:
df_female30.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,103.000000,103.000000,103.000000,103.000000,103.000000,103.000000,103.000000
mean,457.145631,0.805825,1.737864,41.893204,0.504854,0.708738,61.347290
std,257.487194,0.397498,0.803926,8.528686,0.575203,1.288190,70.120968
min,2.000000,0.000000,1.000000,30.500000,0.000000,0.000000,7.750000
25%,264.500000,1.000000,1.000000,35.000000,0.000000,0.000000,16.700000
50%,459.000000,1.000000,2.000000,40.000000,0.000000,0.000000,31.387500
75%,675.000000,1.000000,2.000000,48.000000,1.000000,1.000000,79.825000
max,886.000000,1.000000,3.000000,63.000000,3.000000,6.000000,512.329200

In [43]:
df_female30.info()

<class 'pandas.core.frame.DataFrame'>
Index: 103 entries, 1 to 885
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  103 non-null    int64
 1   Survived     103 non-null    int64
 2   Pclass       103 non-null    int64
 3   Name         103 non-null    object
 4   Sex          103 non-null    object
 5   Age          103 non-null    float64
 6   SibSp        103 non-null    int64
 7   Parch        103 non-null    int64
 8   Ticket       103 non-null    object
 9   Fare         103 non-null    float64
 10  Cabin        49 non-null     object
 11  Embarked     101 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 10.5+ KB

In [47]:
df_female = df_titanic1[df_titanic1['Sex'] == 'female']

In [48]:
df_female.info()

<class 'pandas.core.frame.DataFrame'>
Index: 314 entries, 1 to 888
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  314 non-null    int64
 1   Survived     314 non-null    int64
 2   Pclass       314 non-null    int64
 3   Name         314 non-null    object
 4   Sex          314 non-null    object
 5   Age          261 non-null    float64
 6   SibSp        314 non-null    int64
 7   Parch        314 non-null    int64
 8   Ticket       314 non-null    object
 9   Fare         314 non-null    float64
 10  Cabin        97 non-null     object
 11  Embarked     312 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 31.9+ KB

In [55]:
df_female[df_female['Age'].isnull()].info()

<class 'pandas.core.frame.DataFrame'>
Index: 53 entries, 19 to 888
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  53 non-null     int64
 1   Survived     53 non-null     int64
 2   Pclass       53 non-null     int64
 3   Name         53 non-null     object
 4   Sex          53 non-null     object
 5   Age          0 non-null      float64
 6   SibSp        53 non-null     int64
 7   Parch        53 non-null     int64
 8   Ticket       53 non-null     object
 9   Fare         53 non-null     float64
 10  Cabin        7 non-null      object
 11  Embarked     53 non-null     object
dtypes: float64(2), int64(5), object(5)
memory usage: 5.4+ KB

In [ ]:
df_titanic1[df_titanic1['Age'].isnull() & (df_titanic1['Sex'] == 'female')].shape[0]

53

In [ ]:
#como extraer los valores no nulos con alguna condicion

df_female30[df_female30['Age'].notna()].shape[0]

103

### como agregar columnas nuevas

In [ ]:
#revisar el resultado de la nueva columna sin modificar el dataframe original

df_titanic1['Age'] * 12

0      264.0
1      456.0
2      312.0
3      420.0
4      420.0
       ...
886    324.0
887    228.0
888      NaN
889    312.0
890    384.0
Name: Age, Length: 891, dtype: float64

In [57]:
#como agregar una nueva columna al dataframe, por ejemplo, una columna con la edad en meses

df_titanic1['Age_months'] = df_titanic1['Age'] * 12

In [58]:
df_titanic1.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_months
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,264.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,456.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,312.0

In [61]:
# como reordenar las columnas del dataframe

print (df_titanic1.columns.to_list())

['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'Age_months']

In [62]:
new_order_columns = ['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age','Age_months', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']

In [63]:
df_titanic1 = df_titanic1[new_order_columns]

In [64]:
df_titanic1.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,Age_months,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,264.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,456.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,312.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [86]:


print (df_female[df_female['Age'].isnull() & (df_female['Embarked'] == 'C')].shape[0]),
print (df_female[df_female['Age'].isnull() & (df_female['Embarked'] == 'S')].shape[0]),
print (df_female[df_female['Age'].isnull() & (df_female['Embarked'] == 'Q')].shape[0])

12
17
24

### Estadisticos por atributo

In [69]:
df_titanic1['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [72]:
df_titanic1['Sex'].unique()

array(['male', 'female'], dtype=object)

In [73]:
df_titanic1['Age'].mean()

np.float64(29.69911764705882)

### groupby

In [91]:
df_titanic1[['Age', 'Sex']].groupby('Sex').mean()

              Age
Sex
female  27.915709
male    30.726645